# Challenge 3

In this challenge we will work on the `Orders` data set. In your work you will apply the thinking process and workflow we showed you in Challenge 2.

You are serving as a Business Intelligence Analyst at the headquarter of an international fashion goods chain store. Your boss today asked you to do two things for her:

**First, identify two groups of customers from the data set.** The first group is **VIP Customers** whose **aggregated expenses** at your global chain stores are **above the 95th percentile** (aka. 0.95 quantile). The second group is **Preferred Customers** whose **aggregated expenses** are **between the 75th and 95th percentile**.

**Second, identify which country has the most of your VIP customers, and which country has the most of your VIP+Preferred Customers combined.**

## Q1: How to identify VIP & Preferred Customers?

We start by importing all the required libraries:

In [1]:
# import required libraries
import numpy as np
import pandas as pd

Next, extract and import `Orders` dataset into a dataframe variable called `orders`. Print the head of `orders` to overview the data:

In [2]:
# your code here

orders = pd.read_csv('orders.csv')

orders

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
397919,541904,581587,22613,2011,12,5,12,pack of 20 spaceboy napkins,12,2011-12-09 12:50:00,0.85,12680,France,10.20
397920,541905,581587,22899,2011,12,5,12,children's apron dolly girl,6,2011-12-09 12:50:00,2.10,12680,France,12.60
397921,541906,581587,23254,2011,12,5,12,childrens cutlery dolly girl,4,2011-12-09 12:50:00,4.15,12680,France,16.60
397922,541907,581587,23255,2011,12,5,12,childrens cutlery circus parade,4,2011-12-09 12:50:00,4.15,12680,France,16.60
397923,541908,581587,22138,2011,12,5,12,baking set 9 piece retrospot,3,2011-12-09 12:50:00,4.95,12680,France,14.85

---

"Identify VIP and Preferred Customers" is the non-technical goal of your boss. You need to translate that goal into technical languages that data analysts use:

## How to label customers whose aggregated `amount_spent` is in a given quantile range?

We break down the main problem into several sub problems:

#### Sub Problem 1: How to aggregate the  `amount_spent` for unique customers?

#### Sub Problem 2: How to select customers whose aggregated `amount_spent` is in a given quantile range?

#### Sub Problem 3: How to label selected customers as "VIP" or "Preferred"?

*Note: If you want to break down the main problem in a different way, please feel free to revise the sub problems above.*

Now in the workspace below, tackle each of the sub problems using the iterative problem solving workflow. Insert cells as necessary to write your codes and explain your steps.

In [3]:
orders.groupby('CustomerID', as_index=False)['amount_spent'].sum()

      CustomerID  amount_spent
0          12346      77183.60
1          12347       4310.00
2          12348       1797.24
3          12349       1757.55
4          12350        334.40
...          ...           ...
4334       18280        180.60
4335       18281         80.82
4336       18282        178.05
4337       18283       2094.88
4338       18287       1837.28

[4339 rows x 2 columns]

In [4]:
# your code here

# Problem 1:

total_spent = orders.groupby('CustomerID', as_index=False).agg({'amount_spent':'sum'})
total_spent.columns = ['CustomerID', 'Total_spent']

In [5]:
total_spent

      CustomerID  Total_spent
0          12346     77183.60
1          12347      4310.00
2          12348      1797.24
3          12349      1757.55
4          12350       334.40
...          ...          ...
4334       18280       180.60
4335       18281        80.82
4336       18282       178.05
4337       18283      2094.88
4338       18287      1837.28

[4339 rows x 2 columns]

In [6]:
# Problem 2-3:

total_spent.loc[total_spent['Total_spent'] > total_spent['Total_spent'].quantile(0.75), 'Customer'] = 'Preferred'
                
total_spent.loc[total_spent['Total_spent'] > total_spent['Total_spent'].quantile(0.95), 'Customer'] = 'VIP'

In [7]:
total_spent

      CustomerID  Total_spent   Customer
0          12346     77183.60        VIP
1          12347      4310.00  Preferred
2          12348      1797.24  Preferred
3          12349      1757.55  Preferred
4          12350       334.40        NaN
...          ...          ...        ...
4334       18280       180.60        NaN
4335       18281        80.82        NaN
4336       18282       178.05        NaN
4337       18283      2094.88  Preferred
4338       18287      1837.28  Preferred

[4339 rows x 3 columns]

Now we'll leave it to you to solve Q2 & Q3, which you can leverage from your solution for Q1:

## Q2: How to identify which country has the most VIP Customers?

In [8]:
# your code here

vips = total_spent.loc[total_spent['Customer'] == 'VIP']

vips

      CustomerID  Total_spent Customer
0          12346     77183.60      VIP
10         12357      6207.67      VIP
12         12359      6372.58      VIP
50         12409     11072.67      VIP
55         12415    124914.53      VIP
...          ...          ...      ...
4207       18109      8052.97      VIP
4229       18139      8438.34      VIP
4253       18172      7561.68      VIP
4292       18223      6484.54      VIP
4298       18229      7276.90      VIP

[217 rows x 3 columns]

In [9]:
# all unique data on CustomerID and Country

df = orders[['CustomerID', 'Country', 'amount_spent']].groupby(['CustomerID', 'Country'], as_index=False)['amount_spent'].sum()

df

      CustomerID         Country  amount_spent
0          12346  United Kingdom      77183.60
1          12347         Iceland       4310.00
2          12348         Finland       1797.24
3          12349           Italy       1757.55
4          12350          Norway        334.40
...          ...             ...           ...
4342       18280  United Kingdom        180.60
4343       18281  United Kingdom         80.82
4344       18282  United Kingdom        178.05
4345       18283  United Kingdom       2094.88
4346       18287  United Kingdom       1837.28

[4347 rows x 3 columns]

In [10]:
# doing inner merge to get VIP customer's country

inner_vips = pd.merge(df, vips, on='CustomerID')

inner_vips

     CustomerID         Country  amount_spent  Total_spent Customer
0         12346  United Kingdom      77183.60     77183.60      VIP
1         12357     Switzerland       6207.67      6207.67      VIP
2         12359          Cyprus       6372.58      6372.58      VIP
3         12409     Switzerland      11072.67     11072.67      VIP
4         12415       Australia     124914.53    124914.53      VIP
..          ...             ...           ...          ...      ...
213       18109  United Kingdom       8052.97      8052.97      VIP
214       18139  United Kingdom       8438.34      8438.34      VIP
215       18172  United Kingdom       7561.68      7561.68      VIP
216       18223  United Kingdom       6484.54      6484.54      VIP
217       18229  United Kingdom       7276.90      7276.90      VIP

[218 rows x 5 columns]

In [11]:
inner_vips['Country'].value_counts()

# Uniteg Kingdom is the country with most VIP customers

United Kingdom     177
Germany             10
France               9
Switzerland          3
Japan                2
Spain                2
Portugal             2
Australia            2
EIRE                 2
Finland              1
Belgium              1
Sweden               1
Denmark              1
Singapore            1
Netherlands          1
Cyprus               1
Channel Islands      1
Norway               1
Name: Country, dtype: int64

## Q3: How to identify which country has the most VIP+Preferred Customers combined?

In [12]:
# your code here

vips = total_spent.loc[(total_spent['Customer'] == 'VIP')]

preferred = total_spent.loc[(total_spent['Customer'] == 'Preferred')]

In [13]:
inner_preferred = pd.merge(df, preferred, on='CustomerID') # df: all unique data on CustomerID and Country (calculated above)

inner_vips = pd.merge(df, vips, on='CustomerID')

In [14]:
concatenated = pd.concat([inner_vips, inner_preferred])

concatenated['Country'].value_counts()

# United Kingdom is the country with most VIP and Preferred customers

United Kingdom     932
Germany             39
France              29
Belgium             12
Spain                9
Switzerland          9
Norway               7
Portugal             7
Italy                5
Finland              5
Cyprus               4
Japan                4
Australia            4
Channel Islands      4
Austria              3
EIRE                 3
Denmark              3
Israel               2
Sweden               2
Singapore            1
Canada               1
Malta                1
Poland               1
Lebanon              1
Netherlands          1
Iceland              1
Greece               1
Name: Country, dtype: int64